---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementBoundarySubface.SubfaceType
source: html/f9b2dfe3-0c2a-44e8-d8bf-0a4f633d6c02.htm
---
# Autodesk.Revit.DB.SpatialElementBoundarySubface.SubfaceType Property

Type of the subface.

## Syntax (C#)
```csharp
public SubfaceType SubfaceType { get; }
```